## Q4. Consider two excel files having attendance of a workshop’s participants for two days. Each file has three fields ‘Name’, ‘Time of joining’, duration (in minutes) where names are unique within a file. Note that duration may take one of three values (30, 40, 50) only. Import the data into two dataframes and do the following:

In [ ]:
import pandas as pd

In [2]:
first_workshop = pd.read_excel('Attendence-1.xlsx')
second_workshop = pd.read_excel('Attendence-2.xlsx')

In [3]:
first_frame = pd.DataFrame(first_workshop)
second_frame = pd.DataFrame(second_workshop)

### a. Perform merging of the two dataframes to find the names of students who had attended the workshop on both days.

In [4]:
pd.merge(first_frame, second_frame, on='Name', how='inner')

              Name Time Of Joining_x  Duration_x Time Of Joining_y  Duration_y
0            green          10:10:00        40.0          10:10:00          40
1     mr fantastic          10:20:00        50.0          10:20:00          50
2  invisible women          10:30:00        50.0          10:30:00          50
3          ant man          10:40:00        30.0          10:40:00          30

### b. Find names of all students who have attended workshop on either of the days.

In [5]:
pd.merge(first_frame, second_frame, on='Name', how='outer')

              Name Time Of Joining_x  Duration_x Time Of Joining_y  Duration_y
0            james          10:00:00        30.0               NaN         NaN
1            green          10:10:00        40.0          10:10:00        40.0
2     mr fantastic          10:20:00        50.0          10:20:00        50.0
3  invisible women          10:30:00        50.0          10:30:00        50.0
4          ant man          10:40:00        30.0          10:40:00        30.0
5            susan               NaN         NaN          10:00:00        20.0

### c. Merge two data frames row-wise and find the total number of records in the data frame.

In [7]:
total_records = pd.concat({'Day 1': first_frame, 'Day 2': second_frame}, axis=0)

In [8]:
total_records

                    Name Time Of Joining  Duration
Day 1 0            james        10:00:00      30.0
      1            green        10:10:00      40.0
      2     mr fantastic        10:20:00      50.0
      3  invisible women        10:30:00      50.0
      4          ant man        10:40:00      30.0
Day 2 0            susan        10:00:00      20.0
      1            green        10:10:00      40.0
      2     mr fantastic        10:20:00      50.0
      3  invisible women        10:30:00      50.0
      4          ant man        10:40:00      30.0

In [9]:
len(total_records)

10